'''
    Функция       |       Описание
    --------------------------------------------
    int(x)        |    Преобразование x
                  |      в целое число
    --------------------------------------------
    float(x)      |    Преобразование x в число
                  |      с плавающей точкой
    --------------------------------------------
    str(x)        |     Преобразование x  в
                  |      строковое представление
    --------------------------------------------
    chr(x)        |     Преобразует целое x
                  |      в символ
    --------------------------------------------
    unichr(x)     |     Преобразует целое x
                  |      в символ Unicode
    --------------------------------------------
    ord(x)        |     Преобразует целое x
                  |      в соответствующее ему
                  |      целое число
    --------------------------------------------
    hex(x)        |     Преобразует символ x в
                  |      шестнадцатеричную строку
    --------------------------------------------
    oct(x)        |     Преобразует символ x в
                        восьмеричную строку
    --------------------------------------------
'''

a = input('Enter A Number ')
b = input('Now Enter Another Number ')

sum = a + b
print('\nData Type sum :', sum, type(sum))

sum = int(a) + int(b)
print('Data type sum:', sum, type(sum))

sum = float(sum)
print('Data type sum:', sum, type(sum))

sum = chr(int(sum))
print('Data type sum:', sum, type(sum))
